benchmark/old_outputs/single_thread/sieve_new/zipf_16/2026-04-17T20:23:13-04:00_1_9_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1360168
number of failed transactions: 0 (0.000%)
latency average = 0.265 ms
initial connection time = 2.975 ms
tps = 7556.604925 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 1 (targets 10.0% of total)
 - 135586 transactions (10.0% of total)
 - number of transactions actually processed: 135586 (tps = 753.267122)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.083 ms
 - latency stddev = 0.012 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 9 (targets 90.0% of total)
 - 1224582 transactions (90.0% of total)
 - number of transactions actually processed: 1224582 (tps = 6803.337802)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.284 ms
 - latency stddev = 0.108 ms
ratio: .9974365266326397